Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: :mod:`distutils.command.bdist_wininst` --- Build a Windows installer
pl: :mod:`distutils.command.bdist_wininst` --- Zbuduj instalator Windows

source: :mod:`distutils.command.sdist` --- Build a source distribution
pl: :mod:`distutils.command.sdist` --- Zbuduj dystrybucję źródeł.

source: :mod:`distutils.command.build` --- Build all files of a package
pl: :mod:`distutils.command.build` --- Zbuduj wszystkie pliki w pakiecie

source: :mod:`distutils.command.build_clib` --- Build any C libraries in a package
pl: :mod:`distutils.command.build_clib` --- Zbuduj wszystkie biblioteki C w pakiecie

source: :mod:`distutils.command.build_ext` --- Build any extensions in a package
pl: :mod:`distutils.command.build_ext` --- Zbuduj wszystkie rozszerzenia w pakiecie

source: :mod:`distutils.command.build_py` --- Build the .py/.pyc files of a package
pl: :mod:`distutils.command.build_py` --- Zbuduj pliki .py/.pyc w pakiecie

source: Alternative implementation of build_py which also runs the 2to3 conversion library on each .py file that is going to be installed. To use this in a setup.py file for a distribution that is designed to run with both Python 2.x and 3.x, add::
pl: Alternatywne wypełnienie build_py, które także uruchamia bibliotekę konwersji 2to3 na każdym pliku .py, który zostanie zainstalowany. Aby użyć tego w pliku setup.py dla dystrybucji która jest zaprojektowana aby działać zarówno z językiem pytonowskim 2.x jak i 3.x, dodaj::

source: to your setup.py, and later::
pl: do twojego setup.py, i później::

source: to the invocation of setup().
pl: do wywołania setup().

source: :mod:`distutils.command.build_scripts` --- Build the scripts of a package
pl: :mod:`distutils.command.build_scripts` --- Zbuduj skrypty pakietu

source: :mod:`distutils.command.clean` --- Clean a package build area
pl: :mod:`distutils.command.clean` --- Wyczyść przestrzeń budowy pakietu

source: :mod:`distutils.command.config` --- Perform package configuration
pl: :mod:`distutils.command.config` --- Wykonaj konfigurację pakietu

source: :mod:`distutils.command.install` --- Install a package
pl: :mod:`distutils.command.install` --- Instaluj pakiet

source: :mod:`distutils.command.install_data` --- Install data files from a package
pl: :mod:`distutils.command.install_data` --- Instaluj pliki danych z pakietu

source: :mod:`distutils.command.install_headers` --- Install C/C++ header files from a package
pl: :mod:`distutils.command.install_headers` --- Zainstaluj pliki nagłówkowe C/C++ z pakietu

source: :mod:`distutils.command.install_lib` --- Install library files from a package
pl: :mod:`distutils.command.install_lib` --- Instaluj pliki bibliotek z pakietu

source: :mod:`distutils.command.install_scripts` --- Install script files from a package
pl: :mod:`distutils.command.install_scripts` --- Instaluj pliki skryptów z pakietu

source: :mod:`distutils.command.register` --- Register a module with the Python Package Index
pl: :mod:`distutils.command.register` --- Zarejestruj moduł na indeksie pakietów języka pytonowskiego

source: The ``register`` command registers the package with the Python Package Index. This is described in more detail in :pep:`301`.
pl: komenda ``register`` rejestruje pakiet na indeksie pakietów języka pytonowskiego ( - z ang. - Python Package Index ). Jest to opisane bardziej szczegółowo w :pep:`301`.

source: Creating a new Distutils command
pl: Tworzenie nowego polecenia Distutils

source: This section outlines the steps to create a new Distutils command.
pl: Ta sekcja opisuje kroki prowadzące do utworzenia nowego polecenia Distutils.

source: A new command lives in a module in the :mod:`distutils.command` package. There is a sample template in that directory called :file:`command_template`. Copy this file to a new module with the same name as the new command you're implementing. This module should implement a class with the same name as the module (and the command). So, for instance, to create the command ``peel_banana`` (so that users can run ``setup.py peel_banana``), you'd copy :file:`command_template` to :file:`distutils/command/peel_banana.py`, then edit it so that it's implementing the class :class:`peel_banana`, a subclass of :class:`distutils.cmd.Command`.
pl: Nowe polecenie żyje w module w pakiecie :mod:`distutils.command`. W tamtym katalogu istnieje przykład nowego polecenia nazwany :file:`command_template`. Skopiuj go do nowego modułu o tej samej nazwie jak polecenie które wypełniasz. Ten moduł powinien wypełniać szczegóły uogólnienia o tej samej nazwie jak moduł (i jak polecenie). Więc na przykład, aby utworzyć polecenie ``obrac_banan`` (tak, aby użytkownik mógł uruchomić ``setup.py obrac_banan``), potrzeba skopiować plik :file:`command_template` do :file:`distutils/command/obrac_banan.py`, potem zmienić jego zawartość tak, aby wypełnić sens uogólnienia polecenia :class:`obrac_banan`, podrzędnego względem :class:`distutils.cmd.Command`.

source: Subclasses of :class:`Command` must define the following methods.
pl: Uogólnienia podrzędne względem uogólnienia :class:`Command` muszą określać następujące sposoby postępowania.

source: Set default values for all the options that this command supports. Note that these defaults may be overridden by other commands, by the setup script, by config files, or by the command-line. Thus, this is not the place to code dependencies between options; generally, :meth:`initialize_options` implementations are just a bunch of ``self.foo = None`` assignments.
pl: Ustal wartości domyślne dla wszystkich opcji które to polecenie wspiera. Zwróć uwagę, że te wartości domyślne mogą na nowo zdefiniowane przez inne polecenia, przez skrypty ustawiające, przez pliki konfiguracyjne, lub przez wiersz-poleceń. Zatem nie jest to miejsce aby zakodowywać zależności pomiędzy opcjami; W ogóle wypełnienia :meth:`initialize_options` są po prostu wiechciem przypisań ``self.foo = None``.

source: Set final values for all the options that this command supports. This is always called as late as possible, ie. after any option assignments from the command-line or from other commands have been done. Thus, this is the place to to code option dependencies: if *foo* depends on *bar*, then it is safe to set *foo* from *bar* as long as *foo* still has the same value it was assigned in :meth:`initialize_options`.
pl: Ustaw końcowe wartości dla wszystkich opcji które to polecenie wspiera. To jest zawsze wywoływane tak późno jak tylko się da, tj. po tym jak jakiekolwiek przypisania opcji z wiersza poleceń lub innych poleceń zostały przeprowadzone. Zatem, to jest miejsce aby zakodować zależności opcji: jeśli *foo* zależy od *bar*, wtedy można bezpiecznie ustawić *foo* przy użyciu *bar* tak długo jak *foo* wciąż ma tą samą wartość jaka była mu przypisana przez sposób postępowania :meth:`initialize_options`.

source: A command's raison d'etre: carry out the action it exists to perform, controlled by the options initialized in :meth:`initialize_options`, customized by other commands, the setup script, the command-line, and config files, and finalized in :meth:`finalize_options`. All terminal output and filesystem interaction should be done by :meth:`run`.
pl: Sens ist-nie-nia po-le-ce-nia: wypełnić działanie do jakiego jest przeznaczone, kontrolowane przez opcje inicjowane w sposobie postępowania :meth:`initialize_options`, dostosowywane przez inne polecenia, skrypty ustawień, wiersz poleceń, pliki konfiguracji, i kończone w sposobie postępowania :meth:`finalize_options`. Wszystkie wypisywania na terminal i współdziałanie z systemem plików powinno odbywać się w sposobie postępowania :meth:`run`.

source: *sub_commands* formalizes the notion of a "family" of commands, eg. ``install`` as the parent with sub-commands ``install_lib``, ``install_headers``, etc. The parent of a family of commands defines *sub_commands* as a class attribute; it's a list of 2-tuples ``(command_name, predicate)``, with *command_name* a string and *predicate* a function, a string or None. *predicate* is a method of the parent command that determines whether the corresponding command is applicable in the current situation. (Eg. we ``install_headers`` is only applicable if we have any C header files to install.) If *predicate* is None, that command is always applicable.
pl: *sub_commands* formalizuje pomysł "rodziny" poleceń, np. ``install`` jako rodzica z pod-poleceniami ``install_lib``, ``install_headers``, itd. Rodzic rodziny poleceń określa *sub_commands* - z ang - *pod-polecenia* jako właściwość uogólnienia; jest listą 2-krotek ``(nazwa_polecenia, predykat)`` z *nazwą_polecenia* - z ang. - *command_name* - ciągiem znaków i *predykatem* - z ang. - *predicate* - funkcją, ciągiem znaków lub niczym - z ang. - None. *predykat* - z ang. - *predicate* jest sposobem postępowania polecenia nadrzędnego, która ustala czy odpowiadające polecenie jest właściwe w danej sytuacji. (Np. ``install_headers`` jest tylko właściwe jeśli mamy jakieś pliki nagłówkowe C do zainstalowania.) Jeśli *predykat* jest Żaden - z ang. - None, to polecenie jest zawsze właściwe.

source: *sub_commands* is usually defined at the \*end\* of a class, because predicates can be methods of the class, so they must already have been defined. The canonical example is the :command:`install` command.
pl: *pod_polecenia* - z ang. - *sub_commands* jest zwykle określane na \*końcu\* z ang. - \*end\* uogólnienia, gdyż predykaty mogą być sposobami postępowania uogólnienia, więc muszą być już zdefiniowane. Najwłaściwszym przykładem jest polecenie :command:`install`.

source: Creating Built Distributions
pl: Tworzenie Zbudowanych Dystrybucji

source: A "built distribution" is what you're probably used to thinking of either as a "binary package" or an "installer" (depending on your background). It's not necessarily binary, though, because it might contain only Python source code and/or byte-code; and we don't call it a package, because that word is already spoken for in Python. (And "installer" is a term specific to the world of mainstream desktop systems.)
pl: "Zbudowana dystrybucja" jest pewnie tym do czego przyzwyczaiłeś się myśleć gdy napotykasz "binarny pakiet" lub "instalator" (w zależności od twoich dotychczasowych doświadczeń). Nie jest ona jednak koniecznie binarna, gdyż może zawierać tylko kod w języku pytonowskim i/lub kod-kęsowy; i nie nazywamy jej pakietem, gdyż ten termin jest już zarezerwowany w języku pytonowskim. (Zaś "instalator" jest terminem szczególnym dla świata systemów typu desktop głównego nurtu.)

source: A built distribution is how you make life as easy as possible for installers of your module distribution: for users of RPM-based Linux systems, it's a binary RPM; for Windows users, it's an executable installer; for Debian-based Linux users, it's a Debian package; and so forth. Obviously, no one person will be able to create built distributions for every platform under the sun, so the Distutils are designed to enable module developers to concentrate on their specialty---writing code and creating source distributions---while an intermediary species called *packagers* springs up to turn source distributions into built distributions for as many platforms as there are packagers.
pl: Zbudowana dystrybucja to sposób w jaki możesz ułatwić życie tak bardzo jak to jest możliwe dla osób instalujących dystrybucję twojego modułu: dla użytkowników systemu Linux opartego o pakiety RPM, jest to binarny RPM; dla użytkowników Windows, jest to wykonywalny instalator; dla użytkowników systemu Linux opartego o Debiana jest to pakiet Debiana, itd. Oczywiście nikt przy zdrowych zmysłach nie jest w stanie tworzyć zbudowanych dystrybucji dla każdej maszyny/środowiska pod słońcem, więc Distutils są pomyślane tak aby umożliwić twórcom modułów skupienie się na tym na czym się znają najlepiej---pisaniu kodu i tworzeniu dystrybucji źródłowej---podczas gdy kasta pośrednicząca zwana *pakieciarzami* narodziła się aby zamieniać dystrybucje źródłowe w zbudowane dystrybucje dla tak wielu maszyn/środowisk jak wielu jest pakieciarzy.

source: Of course, the module developer could be his own packager; or the packager could be a volunteer "out there" somewhere who has access to a platform which the original developer does not; or it could be software periodically grabbing new source distributions and turning them into built distributions for as many platforms as the software has access to. Regardless of who they are, a packager uses the setup script and the :command:`bdist` command family to generate built distributions.
pl: Oczywiście twórca modułu mógłby być swoim własnym pakieciarzem; lub pakieciarz mógłby być wolontariuszem "tam gdzieś" w szerokim świecie - kimś kto ma dostęp do maszyny/środowiska do którego pierwotny twórca nie ma; lub mógłby być oprogramowaniem regularnie pobierającym nowe dystrybucje źródłowe i zamieniających je w zbudowane dystrybucje dla tak wielu maszyn/środowisk do jak wielu ten program miałby dostęp. Niezależnie od tego, kim jest, pakieciarz korzysta ze skryptu instalacyjnego i rodziny poleceń :command:`bdist` do wytwarzania zbudowanych dystrybucji.

source: As a simple example, if I run the following command in the Distutils source tree::
pl: Jako prosty przykład, jeśli uruchomię następujące polecenie na drzewie źródeł Distutils::

source: then the Distutils builds my module distribution (the Distutils itself in this case), does a "fake" installation (also in the :file:`build` directory), and creates the default type of built distribution for my platform. The default format for built distributions is a "dumb" tar file on Unix, and a simple executable installer on Windows. (That tar file is considered "dumb" because it has to be unpacked in a specific location to work.)
pl: wtedy Distutils buduje dystrybucję mojego modułu (samo Distutils w tym przypadku), wykonuje "fałszywą" instalację (także w katalogu :file:`build`), i tworzy domyślny rodzaj zbudowanej dystrybucji dla mojej maszyny/środowiska. Domyślnym formatem dla zbudowanych dystrybucji jest "durny" plik tar na Unix-ie, i prosty wykonywalny instalator w Windows. (Ten plik tar jest uznawany za "głupi" gdyż musi zostać rozpakowany w szczególnym miejscu aby mógł zadziałać.)

source: Thus, the above command on a Unix system creates :file:`Distutils-1.0.{plat}.tar.gz`; unpacking this tarball from the right place installs the Distutils just as though you had downloaded the source distribution and run ``python setup.py install``. (The "right place" is either the root of the filesystem or Python's :file:`{prefix}` directory, depending on the options given to the :command:`bdist_dumb` command; the default is to make dumb distributions relative to :file:`{prefix}`.)
pl: Więc, powyższe polecenie tworzy w systemie Unix plik :file:`Distutils`1.0.{plat}.tar.gz`; rozpakowanie tego tarball-a z właściwego miejsca instaluje Distutils tak, jakbyś ściągnął dystrybucję źródłową i uruchomił ``python setup.py install`` ("właściwe miejsce" to zarówno katalog nadrzędny systemu plików lub katalog :file:`{prefix}` języka pytonowskiego, zależnie od opcji przekazanych poleceniu :command:`bdist_dumb`; domyślnie jest to robienie niezbyt-mądrej dystrybucji w odniesieniu do :file:`{prefix}`.)

source: Obviously, for pure Python distributions, this isn't any simpler than just running ``python setup.py install``\ ---but for non-pure distributions, which include extensions that would need to be compiled, it can mean the difference between someone being able to use your extensions or not. And creating "smart" built distributions, such as an RPM package or an executable installer for Windows, is far more convenient for users even if your distribution doesn't include any extensions.
pl: Oczywiście, dla czystych dystrybucji języka pytonowskiego, to nie jest w żaden sposób prostsze niż po prostu uruchomienie ``python setup.py install``\ ---ale dla dystrybucji "nie"-czystych, które zawierają rozszerzenia które wymagają kompilacji, może to mieć znaczenie dla kogoś kto będzie mógł użyć twoich rozszerzeń lub nie. Zaś tworzenie "inteligentnie" zbudowanych dystrybucji, takich jak pakiet RPM lub instalator wykonywalny dla Windows, jest dużo prostsze dla użytkowników nawet jeśli twoja dystrybucja nie zawiera żadnych rozszerzeń.

source: The :command:`bdist` command has a :option:`--formats` option, similar to the :command:`sdist` command, which you can use to select the types of built distribution to generate: for example, ::
pl: Polecenie :command:`bdist` ma opcję :option:`--formats`, podobną do polecenia :command:`sdist` które możesz użyć aby wybrać rodzaje zbudowanej dystrybucji do wygenerowania: na przykład, ::

source: would, when run on a Unix system, create :file:`Distutils-1.0.{plat}.zip`\ ---again, this archive would be unpacked from the root directory to install the Distutils.
pl: mogłoby gdy uruchomione na systemie Unix-owym, stworzyć plik :file:`Distutils-1.0.{plat}.zip`\---znów, to archiwum mogłoby być rozpakowane z katalogu nadrzędnego systemu plików w celu zainstalowania Distutils.

source: The available formats for built distributions are:
pl: Dostępne formaty dla zbudowanych dystrybucji to:

source: Description
pl: Opis

source: Notes
pl: Notatki

source: gzipped tar file (:file:`.tar.gz`)
pl: gzip-nięty plik tar (:file:`.tar.gz`)

source: compressed tar file (:file:`.tar.Z`)
pl: skompresowany plik tar (file`.tar.Z`)

source: tar file (:file:`.tar`)
pl: plik tar (:file:`.tar`)

source: zip file (:file:`.zip`)
pl: plik zip (:file:`.zip`)

source: Solaris :program:`pkgtool`
pl: Solarisowe narzędzie :program:`pkgtool`

source: HP-UX :program:`swinstall`
pl: program systemu HP-UX :program:`swinstall`

source: self-extracting ZIP file for Windows
pl: samo-rozpakowujące się archiwum ZIP dla Windows

source: Microsoft Installer.
pl: Instalator Microsoft

source: Notes:
pl: Uwagi:

source: default on Unix
pl: domyślne dla Unix

source: default on Windows
pl: domyślne dla Windows

source: requires external utilities: :program:`tar` and possibly one of :program:`gzip`, :program:`bzip2`, or :program:`compress`
pl: wymaga zewnętrznych użytków: :program:`tar`-a i prawdopodobnie jednego z programów: :program:`gzip`, programu :program:`bzip2`, lub programu :program:`compress`

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
pl: wymaga zewnętrznego programu użytkowego :program:`zip` lub modułu :mod:`zipfile` (części standardowej biblioteki języka pytonowskiego od wersji 1.6 języka pytonowskiego)

source: requires external :program:`rpm` utility, version 3.0.4 or better (use ``rpm --version`` to find out which version you have)
pl: wymaga zewnętrznego programu użytkowego :program:`rpm`, w wersji 3.0.4 lub lepszej (użyj ``rpm --version`` aby dowiedzieć się, którą wersję posiadasz)

source: You don't have to use the :command:`bdist` command with the :option:`--formats` option; you can also use the command that directly implements the format you're interested in. Some of these :command:`bdist` "sub-commands" actually generate several similar formats; for instance, the :command:`bdist_dumb` command generates all the "dumb" archive formats (``tar``, ``ztar``, ``gztar``, and ``zip``), and :command:`bdist_rpm` generates both binary and source RPMs. The :command:`bdist` sub-commands, and the formats generated by each, are:
pl: Nie musisz używać polecenia :command:`bdist` z opcją :option:`--formats`; możesz także użyć polecenia które bezpośrednio wypełnia format którym się interesujesz. Niektóre z tych podrzędnych poleceń :command:`bdist` właściwie generuje kilka podobnych formatów; na przykład polecenie :command:`bdist_dumb` wytwarza wszystkie "głupie" formaty archiwum (``tar``, ``ztar``, ``gztar``, i ``zip``), a polecenie :command:`bdist_rpm` wytwarza zarówno binarne jak i źródłowe pakiety RPM. Podrzędne polecenia :command:`bdist`, i formaty wytworzone przez każdy z nich, to:

source: Command
pl: Polecenie

source: Formats
pl: Formaty

source: The following sections give details on the individual :command:`bdist_\*` commands.
pl: Następujące paragrafy opowiadają w szczegółach o poszczególnych poleceniach :command:`bdist_\*`

source: Creating dumb built distributions
pl: Tworzenie głupich zbudowanych dystrybucji

source: **\*\*** Need to document absolute vs. prefix-relative packages here, but first I have to implement it! **\*\***
pl: **\*\*** Potrzebuję udokumentować bezwzględne vs. względne -zależne-od-przedrostka pakiety tuta, ale wscześniej muszę je wypełnić! **\*\***

source: Creating RPM packages
pl: Tworzenie pakietów RPM

source: The RPM format is used by many popular Linux distributions, including Red Hat, SuSE, and Mandrake. If one of these (or any of the other RPM-based Linux distributions) is your usual environment, creating RPM packages for other users of that same distribution is trivial. Depending on the complexity of your module distribution and differences between Linux distributions, you may also be able to create RPMs that work on different RPM-based distributions.
pl: Format RPM jest używany przez wiele popularnych dystrybucji Linuxa, włączając w to Red Hat, SuSE, i Mandrake. Jeśli jeden z nich (lub jakiekolwiek inne oparte o RPM dystrybucje Linuxa) są twoim typowym środowiskiem, tworzenie pakietów RPM dla innych użytkowników tej samej dystrybucji jest trywialne. W zależności od złożoności dystrybucji twojego modułu i różnic pomiędzy dystrybucjami Linux-a możesz być w stanie stworzyć RPMy, które współpracują z różnymi opartymi-o-RPM dystrybucjami.

source: The usual way to create an RPM of your module distribution is to run the :command:`bdist_rpm` command::
pl: Zwykłym sposobem na utworzenie RPMu twojej dystrybucji modułu jest uruchomienie polecenia :command:`bdist_rpm`::

source: or the :command:`bdist` command with the :option:`--format` option::
pl: lub polecenia :command:`bdist` z opcją :option:`--format`::

source: The former allows you to specify RPM-specific options; the latter allows you to easily specify multiple formats in one run. If you need to do both, you can explicitly specify multiple :command:`bdist_\*` commands and their options::
pl: To pierwsze pozwala ci określić szczególne-dla-RPM opcje; to ostatnie pozwala Ci łatwo tworzyć wiele formatów za jednym zamachem. Jeśli potrzebujesz zrobić obydwu, możesz jawnie wyszczególnić wiele poleceń :command:`bdist_\*` i ich opcji::

source: Creating RPM packages is driven by a :file:`.spec` file, much as using the Distutils is driven by the setup script. To make your life easier, the :command:`bdist_rpm` command normally creates a :file:`.spec` file based on the information you supply in the setup script, on the command line, and in any Distutils configuration files. Various options and sections in the :file:`.spec` file are derived from options in the setup script as follows:
pl: Tworzenie pakietu RPM jest napędzane plikiem :file:`.spec`, tak jak używanie Distutils jest napędzane skryptem instalacyjnym. Aby ułatwić ci życie, polecenie :command:`bidst_rpm` zwykle tworzy plik :file:`.spec` oparte o informację którą mu dostarczasz w skrypcie instalacyjnym, w wierszu poleceń, i w plikach konfiguracyjnych Distutils. Różne opcje i sekcje w pliku :file:`.spec` są pochodnymi po opcjach w skrypcie instalacyjnym w następujący sposób:

source: RPM :file:`.spec` file option or section
pl: plik RPM :file:`.spec` opcja lub sekcja

source: Distutils setup script option
pl: opcja skryptu instalacyjnego Distutils

source: Name
pl: Nazwa

source: Summary (in preamble)
pl: Podsumowanie (w preambule)

source: Version
pl: Wersja

source: Vendor
pl: Dostawca
